<!DOCTYPE html>
<html lang="en">
<head>
        <meta charset="UTF-8">
        <title>Завдання 20 - 26</title>
</head>
<body>

<p>1. Создайте переменную name и присвойте ей значение, содержащее ваше имя, например "Иннокентий".</p>

<a href="/OS 18916/1.php" target="_blank">Перейти</a>
<br><br><br>



<p>2. Создайте переменную age и присвойте ей значение, содержащее ваш возраст, например 20.</p>

<a href="/OS 18916/2.php" target="_blank">Перейти</a>
<br><br><br>



<p>3. Выведите с помощью echo фразу "Меня зовут: %ваше_имя%", например: "Меня зовут: Иннокентий".</p>

<a href="/OS 18916/3.php" target="_blank">Перейти</a>
<br><br><br>


<p>4. Выведите фразу "Мне %ваш_возраст% лет", например: "Мне 20 лет".</p>

<a href="/OS 18916/4.php" target="_blank">Перейти</a>
<br><br><br>



<p>5. Напишите конструкцию if, которая выводит фразу: "Вам еще работать и работать" при условии, что значение переменной
        age попадает в диапазон чисел от 18 до 59 (включительно).</p>
<p>6. Расширьте конструкцию if из п.5, выводя фразу: "Вам пора на пенсию" при условии, что значение переменной age больше 59.</p>

<p>7. Расширьте конструкцию if из п.5-6, выводя фразу: "Вам еще рано работать" при условии, что значение переменной age попадает
        в диапазон чисел от 0 до 17 (включительно).</p>

<p>8. Расширьте конструкцию if из п.5-7, выводя фразу: "Неизвестный возраст" при условии, что значение переменной age является
        отрицательным числом, или вовсе числом не является.</p>
<a href="/OS 18916/5_8.php" target="_blank">Перейти</a>
<br><br><br>





<p>9. Создайте переменную day и присвойте ей произвольное числовое значение.</p>

<p>10. С помощью конструкции switch выведите фразу: "Это рабочий день", если значение переменной day попадает в диапазон чисел от 1 до 5 (включительно).</p>

<p>11. С помощью конструкции switch выведите фразу: "Это выходной день", если значение переменной day попадает в диапазон чисел от 6 до 7 (включительно).</p>

<p>12. С помощью конструкции switch выведите фразу: "Неизвестный день", если значение переменной day не попадает в диапазон чисел от 1 до 7 (включительно).</p>
<a href="/OS 18916/9_12.php" target="_blank">Перейти</a>
<br><br><br>



<p>13. Заданы две переменные: s - длина участка, который проехал автомобиль; t - время движения в часах. Вывести скорость автомобиля на заданном участке в км/час и в м/сек.</p>
<a href="/OS 18916/13.php" target="_blank">Перейти</a>
<br><br><br>



<p>14. Задана переменная $foo = 'bar'; Создать переменную bar, в которой будет храниться число 10. Вывести число 10, используя только переменную $foo (не опечатка).</p>
<a href="/OS 18916/14.php" target="_blank">Перейти</a>
<br><br><br>



<p>15. Написать калькулятор. Переменная $a = изменяемое число. Переменная $b = изменяемое число. Переменная $operator = ‘+’ или ‘-’ или ‘/’ или ‘*’ или '%' (остаток от деления).
На экран выводить результат в зависимости от значений этих переменных. Не забудьте про деление на 0, если надо - выдавать ошибку что на 0 делить нельзя.
</p>
<a href="/OS 18916/15.php" target="_blank">Перейти</a>
<br><br><br>




<p>16. Создайте две переменные $a и $b, значения которых будут числами. Выведите максимальное число из этих двух.</p>

<p>17. Создайте две переменные $a = '78' (строковый тип) и $b = 78 (целочисленный тип). Проверьте эти две переменные на равность, с помощью if выведите "равны" или "не равны".</p>

<p>18. Создайте две переменные $a = '78' (строковый тип) и $b = 78 (целочисленный тип). Проверьте эти две переменные на эквивалентность, с помощью if выведите "эквивалентны" или "не эквивалентны".</p>

<p>19. Выведите результат сравнения $a и $b из п.17 с помощью var_dump.</p>
<a href="/OS 18916/16_19.php" target="_blank">Перейти</a>
<br><br><br>






<p>20. Приведите число 20 к типу boolean. Объясните результат.</p>

<p>21. Приведите число 0 к типу boolean. Объясните результат.</p>

<p>22. Приведите число -20 к типу boolean. Объясните результат.</p>

<p>23. Напишите 3 строки, используя три разные функции для вывода текста.</p>

<p>24. Создайте в файле 3 комментария тремя разными типами.</p>

<p>25. Приведите пример, чем отличается &lt;?php от &lt;?=.</p>

<p>26. Объявите константу DAYS_COUNT равную 7 и константу MONTH_COUNT равную 12 двумя разными способами объявления констант.</p>
<a href="/OS 18916/20_26.php" target="_blank">Перейти</a>
<br><br><br>





<p>27. Выполните скрипт по задаче №4 из консоли (необходимо запустить php скрипт по задаче №4 из командной строки).</p>
</body>
</html>

