<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Title</title>
</head>
<body>

<p>
    Создать форму с полями username, email, message. Сериализовать данные, полученные при отправке формы
    и вывести полученную строку на экран.
</p>

<a href="/devionity_24916/1.php" target="_blank">Перейти</a>

<br>
<p>
    Вычислить количество секунд в году и присвоить это значение переменной.
    Вычислить остаток от деления этого значения на 2
</p>

<a href="/devionity_24916/2.php" target="_blank">Перейти</a>

<br>
<p>
    Создать строку, содержащую число 12345 используя лишь отдельные цифры 1,2,3,4,5 и операцию конкатенации
</p>
<a href="/devionity_24916/3.php" target="_blank">Перейти</a>
<br>

<p>
    Вычислить значение выражения: false && true || false && true || !false && true
    Вывести на экран true/false в зависимости о того, делится переменная $x на 2 или нет.
</p>
<a href="/devionity_24916/4.php" target="_blank">Перейти</a>
<br>
<p>
    Создать алгоритм обмена значениями двух переменных не используя третьей.
</p>
<a href="/devionity_24916/5.php" target="_blank">Перейти</a>
<br>
<p>
    Создать алгоритм вычисления максимального значения двух заданных переменных <br>
    Создать алгоритм вычисления максимального значения двух заданных переменных при помощи тернарного оператора <br>
    Создать алгоритм вычисления максимального значения двух переменных при помощи switch
</p>
<a href="/devionity_24916/6.php" target="_blank">Перейти</a>
<br>
<p>
    Создать алгоритм определения всех простых чисел в промежутке от 1 до 100 при помощи for.
    <br>
    Создать алгоритм определения всех простых чисел в промежутке от 1 до 100 при помощи while.

</p>
<a href="/devionity_24916/7.php" target="_blank">Перейти</a>
<br>
<p>
    Создать массив из 10 любых числовых значений. При помощи foreach вывести на экран те значения, которые делятся на 3
</p>
<a href="/devionity_24916/8.php" target="_blank">Перейти</a>
<br>
<p>
    Выполнить предыдущие задания при помощи альтернативного синтаксиса
</p>
<a href="/devionity_24916/9.php" target="_blank">Перейти</a>
<br>
<p>
    Создать алгоритм для определения первого найденного простого числа в промежутке от 200 до 400.
</p>
<a href="/devionity_24916/10.php" target="_blank">Перейти</a>
<br>
<p>
    Как можно упростить функцию test() в данном скрипте?
</p>
<a href="/devionity_24916/11.php" target="_blank">Перейти</a>

</body>
</html