<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Title</title>
</head>
<body>

<p>
    1. Создать форму с двумя элементами textarea. При отправке формы скрипт должен выдавать только те слова,
    которые есть и в первом и во втором поле ввода.
    Реализацию это логики необходимо поместить в функцию getCommonWords($a, $b),
    которая будет возвращать массив с общими словами
</p>

<a href="/functions_forms_tasks/1.php" target="_blank">Перейти</a>

<br>
<p>
    2. Создать форму с элементом textarea. При отправке формы скрипт должен выдавать ТОП3 длинных слов в тексте.
    Реализовать с помощью функции
</p>

<a href="/functions_forms_tasks/2.php" target="_blank">Перейти</a>

<br>
<p>
    3. Есть текстовый файл. Необходимо удалить из него все слова, длина которых превыщает N символов.
    Значение N задавать через форму. Проверить работу на кириллических строках - найти ошибку, найти решение
</p>

<a href="/functions_forms_tasks/3.php" target="_blank">Перейти</a>

<br>
<p>
    4. Написать функцию, которая выводит список файлов в заданной директории. Директория задается как параметр функции
</p>

<a href="/functions_forms_tasks/4.php" target="_blank">Перейти</a>

<br>
<p>
    5. Написать функцию, которая выводит список файлов в заданной директории, которые содержат искомое слово.
    Директория и искомое слово задаются как параметры функции
</p>

<a href="/functions_forms_tasks/5.php" target="_blank">Перейти</a>

<br>
<p>
    6. Создать страницу, на которой можно загрузить несколько фотографий в галерею.
    Все загруженные фото должны помещаться в папку gallery и выводиться на странице в виде таблицы
</p>

<a href="/functions_forms_tasks/6.php" target="_blank">Перейти</a>

<br>
<p>
    7. Создать гостевую книгу, где любой человек может оставить комментарий в текстовом поле и добавить его.
    Все добавленные комментарии выводятся над текстовым полем
</p>

<a href="/functions_forms_tasks/7.php" target="_blank">Перейти</a>

<br>
<p>
    8. Создать гостевую книгу, где любой человек может оставить комментарий в текстовом поле и добавить его.
    Все добавленные комментарии выводятся над текстовым полем.
    Реализовать проверку на наличие в тексте запрещенных слов, матов. При наличии таких слов - выводить сообщение
    "Некорректный комментарий". Реализовать удаление из комментария всех тегов, кроме тега &lt;b&gt;
</p>

<a href="/functions_forms_tasks/8.php" target="_blank">Перейти</a>

<br>
<p>
    9. Написать функцию, которая переворачивает строку. Было "abcde", должна выдать "edcba".
    Ввод текста реализовать с помощью формы
</p>

<a href="/functions_forms_tasks/9.php" target="_blank">Перейти</a>

<br>
<p>
    10. Написать функцию, которая считает количество уникальных слов в тексте. Слова разделяются пробелами.
    Текст должен вводиться с формы
</p>

<a href="/functions_forms_tasks/10.php" target="_blank">Перейти</a>

<br>
<p>
    11. Написать функцию, которая в качестве аргумента принимает строку, и форматирует ее таким образом,
    что каждое новое предложение начиняется с большой буквы.<br>
    Пример:<br><br>
    Входная строка: 'а васька слушает да ест. а воз и ныне там. а вы друзья как ни садитесь, все в музыканты не годитесь.
    а король-то — голый. а ларчик просто открывался.а там хоть трава не расти.';<br><br>
    Строка, возвращенная функцией :  'А Васька слушает да ест. А воз и ныне там. А вы друзья как ни садитесь,
    все в музыканты не годитесь. А король-то — голый. А ларчик просто открывался.А там хоть трава не расти.'
</p>

<a href="/functions_forms_tasks/11.php" target="_blank">Перейти</a>

<br>
<p>
    12. Написать функцию, которая в качестве аргумента принимает строку, и форматирует ее таким образом,
    что предложения идут в обратном порядке.<br>
    Пример:<br><br>
    Входная строка:  'А Васька слушает да ест. А воз и ныне там. А вы друзья как ни садитесь, все в музыканты не годитесь.
    А король-то — голый. А ларчик просто открывался. А там хоть трава не расти.';<br><br>
    Строка, возвращенная функцией :  'А там хоть трава не расти. А ларчик просто открывался. А король-то — голый.
    А вы друзья как ни садитесь, все в музыканты не годитесь. А воз и ныне там.А Васька слушает да ест.'
</p>

<a href="/functions_forms_tasks/12.php" target="_blank">Перейти</a>

<br>
<p>
    13. Есть строка $string = 'яблоко черешня вишня вишня черешня груша яблоко черешня вишня яблоко вишня вишня черешня
        груша яблоко черешня черешня вишня яблоко вишня вишня черешня вишня черешня груша яблоко черешня черешня вишня
        яблоко вишня вишня черешня черешня груша яблоко черешня вишня'
    <br>
    Подсчитайте, сколько раз каждый фрукт встречается в этой строке. Выведите  в виде списка в порядке уменьшения количества
</p>

<a href="/functions_forms_tasks/13.php" target="_blank">Перейти</a>

<br>
<p>

</p>

<a href="/functions_forms_tasks/14.php" target="_blank">Перейти</a>

</body>
</html>

