<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Title</title>
</head>
<body>

<p>
    Создать текстовый файл, в котором будет 10 строк. В первой строке записать 1, во второй 22,
    в третьей 33, ..., в десятой - десять десяток
</p>

<a href="/devionity_011016/1.php" target="_blank">Перейти</a>

<br>
<p>
    Создать функцию, которая будет выводить на экран массив внутри тегов &ltpre&gt &lt/pre&gt
</p>

<a href="/devionity_011016/2.php" target="_blank">Перейти</a>

<br>
<p>
    Создать функцию, которая будет выводить на экран массив внутри тегов &ltpre&gt &lt/pre&gt <br>
    В зависимости от значения второго аргумента функции, выводить используя var_dump или print_r.<br>
    По умолчанию использовать print_r
</p>

<a href="/devionity_011016/3.php" target="_blank">Перейти</a>

<br>
<p>
    Создать функцию, которая принимает один аргумент в виде массива и дописывает в него <br>
    последним элементом количество значений массива
</p>

<a href="/devionity_011016/4.php" target="_blank">Перейти</a>

<br>
<p>
    Реализовать функцию, которая определяет, будет ли число простым числом
</p>

<a href="/devionity_011016/5.php" target="_blank">Перейти</a>

<br>
<p>
    Определить рекурсивную функцию - аналог функции print_r
</p>

<a href="/devionity_011016/6.php" target="_blank">Перейти</a>


</body>
</html>

