<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <title>Завдання по Devionity</title>
</head>
<body>
<b>
<p>Повторення пройденого матеріалу</p>

<a href="/devionity_18916/dev_1.php" target="_blank">Перейти</a>
<br><br>

<p> Создать массив из названий 5 стран мира. Вывести массив на экран при помощи print_r внутри тегов &ltpre&gt &lt/pre&gt </p>

<a href="/devionity_18916/dev_2.php" target="_blank">Перейти</a>
<br><br>



<p>    Создать ассоциативный массив из 5 элементов, в котором ключи - это названия стран, а значения элементов
    - это столицы стран. Вывести массив на экран
</p>
<a href="/devionity_18916/dev_3.php" target="_blank">Перейти</a>
<br><br>


<p>
    Создать многомерный массив, который иллюстрирует список товаров. Каждый товар - это книга (художественная литература).
    Каждая книга имеет стиль, автора, название и цену. В списке товаров должно быть не менее 3 книг.
</p>
<a href="/devionity_18916/dev_4.php" target="_blank">Перейти</a>
<br><br>


<p>
    Определить константы, которые соответствуют названиям нескольких стран мира. Используя эти константы, сформировать
    массив из соответствующих значений
</p>
<a href="/devionity_18916/dev_5.php" target="_blank">Перейти</a>
<br><br>


<p>Создать скрипт, который бы вывел на экран значение переменной $$$$$hello. Значение может быть любым.</p>
<a href="/devionity_18916/dev_6.php" target="_blank">Перейти</a>
<br><br>


<p>Повторення пройденого матеріалу 2</p>
<a href="/devionity_18916/dev_7.php" target="_blank">Перейти</a>
<br><br>


<p>Создать форму, которая содержит поля name, email, phone. Задать скрипт, который выведет на экран отправленные данные
    - $_POST или $_GET (в зависимости от свойств формы)
</p>
<a href="/devionity_18916/dev_8.php" target="_blank">Перейти</a>
<br><br>

</b>

</body>
</html>
